months = ["Січ", "Лют", "Бер", "Кві", "Тра", "Чер", "Лип", "Сер", "Вер", "Жов", "Лис", "Гру"]

days = [("Пн", "Понеділок", 1), ("Вт", "Вівторок", 2), ("Ср", "Середа", 3), ("Чт", "Четвер", 4), ("Пт", "П'ятниця", 5),
        ("Сб", "Субота", 6), ("Нд", "Неділя", 7)]

days_fullname_dict = {1: "Понеділок", 2: "Вівторок", 3: "Середа", 4: "Четвер", 5: "П'ятниця", 6: "Субота", 7: "Неділя"}

days_eng_ukr_dict = {"Sunday": "Неділя", "Monday": "Понеділок", "Tuesday": "Вівторок", "Wednesday": "Середа",
                     "Thursday": "Четвер", "Friday": "П'ятниця", "Saturday": "Субота"}

days_vidminok_dict = {}

hours = ["01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12", "13", "14", "15",
         "16", "17", "18", "19", "20", "21", "22", "23", "00"]

minutes = ["00", "05", "10", "15", "20", "25", "30", "35", "40", "45", "50", "55"]
