from data.set_dataclasses import Exercise

Push_up_lv_1 = Exercise(
    exercise_id=1,
    exercise_name="Віджимання від стіни",
    exercise_duration=1,
    exercise_definition=("Исходное положение. \n Встаньте лицом к стене, на расстоянии двух-трёх длин стопы от неё. "
                         "Положите ладони на стену, руки выпрямите, но держите их расслабленными. "
                         "Расположите их на уровне груди и на ширину плеч. "
                         "Выпрямите тело, держа бёдра и корпус на одной линии.\n"
                         "Движение вниз:\n"
                         "На вдохе плавно сгибайте локти. "
                         "Слегка коснитесь или максимально приблизьтесь лицом или лбом к стене. "
                         "Контролируйте свои движения, чтобы не удариться головой.\n"
                         "Движение вверх:\n"
                         "Разгибайте локти, пока руки не выпрямятся. Выдыхайте, когда отталкиваетесь. "
                         "Держите тело ровно и пусть локти движутся естественно. "
                         "Как только выпрямите руки, повторите упражнение."),
    exercise_file="CgACAgIAAxkBAAIG9mKwp4NPmfdsQY12C09JjblwE-HgAAIxHAACqeqISWaYptsw-iUmKAQ"
)

Push_up_lv_2 = Exercise(
    exercise_id=2,
    exercise_name="Віджимання у нахилі",
    exercise_duration=1,
    exercise_definition=(
        "Исходное положение. \n  Понадобится устойчивый предмет высотой приблизительно до уровня бёдер. Наклонитесь и обопритесь о его поверхность прямыми руками, расположив их на ширине плеч. Не распрямляйте руки до конца — оставьте их немного согнутыми («мягкими»). Сдвигайте ноги назад, пока они не выпрямятся. Встаньте на пальцы, ноги вместе, выровняйте корпус.\n"
        "Движение вниз:\n"
        "Сгибая локти, медленно наклонитесь вперёд: не роняйте себя, а плавно опускайтесь. На вдохе сгибайте руки в локтях, пока грудь слегка коснётся поверхности. Задержитесь в этой позиции на один счёт.\n"
        "Движение вверх:\n"
        "Отожмитесь, пока руки не выпрямятся. Выдыхайте по дороге назад. Всегда держите тело прямо, позволяя локтям двигаться естественно. Как только руки выпрямятся, повторите упражнение."),
    exercise_file="CgACAgIAAxkBAAIG-GKwp7DMG8VfyZxvoRMc_-zKJd0-AAIyHAACqeqISW0Y5naEPUOYKAQ"
)

Push_up_lv_3 = Exercise(
    exercise_id=3,
    exercise_name="Віджимання з колін",
    exercise_duration=1,
    exercise_definition=(
        "Исходное положение. \n   Встаньте на колени. Обопритесь руками об пол перед собой, расположив их на ширине плеч и точно под плечами. Держите руки прямо. Поднимите пятки так, чтобы голени располагались под прямым углом к полу, сцепите ноги крест накрест.\nДвижение вниз:\nОпираясь на колени, сгибайте руки в локтях, делая вдох во время опускания. Остановитесь когда грудь будет на высоте кулака от пола. Не забудьте задержаться на один счёт в этой позиции.\nДвижение вверх:\nОтожмитесь от пола, пока руки не выпрямятся. Выдыхайте по дороге в исходное положение. Бёдра и корпус сохраняйте прямыми на протяжении всего движения. Позвольте локтям двигаться естественно — не разводите их в стороны. Вернувшись в исходное положение, повторите упражнение."),
    exercise_file="CgACAgIAAxkBAAIG9GKwpyQHfHDuhmIhMNvlRcXRoSwgAAIuHAACqeqISc_-XAMpqLh2KAQ"
)

exercises_paul_wade = [Push_up_lv_1, Push_up_lv_2, Push_up_lv_3]
